{
    "doi": "10.3389/frobt.2024.1272403",
    "abstract": [
        ["en", "Experiments on physical continuum robot are the gold standard for evaluations. Currently, as no commercial continuum robot platform is available, a large variety of early-stage prototypes exists. These prototypes are developed by individual research groups and are often used for a single publication. Thus, a significant amount of time is devoted to creating proprietary hardware and software hindering the development of a common platform, and shifting away scarce time and efforts from the main research challenges.\n\nWe address this problem by proposing an open-source actuation module, which can be used to build different types of continuum robots. It consists of a high-torque brushless electric motor, a high resolution optical encoder, and a low-gear-ratio transmission. For this letter, we create three different types of continuum robots. In addition, we illustrate, for the first time, that continuum robots built with our actuation module can proprioceptively detect external forces. Consequently, our approach opens untapped and under-investigated research directions related to the dynamics and advanced control of continuum robots, where sensing the generalized flow and effort is mandatory. Besides that, we democratize continuum robots research by providing open-source software and hardware with our initiative called the Open Continuum Robotics Project, to increase the accessibility and reproducibility of advanced methods."],
        ["es", "Los experimentos con robots de continuo físico son el estándar de oro para las evaluaciones. Actualmente, como no hay disponible ninguna plataforma de robot continuo comercial, existe una gran variedad de prototipos en etapas iniciales. Estos prototipos son desarrollados por grupos de investigación individuales y, a menudo, se utilizan para una única publicación. Por lo tanto, se dedica una cantidad significativa de tiempo a crear hardware y software propietarios, lo que dificulta el desarrollo de una plataforma común y desvía tiempo y esfuerzos escasos de los principales desafíos de la investigación.\n\nAbordamos este problema proponiendo una actuación de código abierto módulo, que se puede utilizar para construir diferentes tipos de robots continuos. Consiste en un motor eléctrico sin escobillas de alto par, un codificador óptico de alta resolución y una transmisión de baja relación de transmisión. Para esta carta, creamos tres tipos diferentes de robots continuos. Además, ilustramos, por primera vez, que los robots continuos construidos con nuestro módulo de actuación pueden detectar fuerzas externas de forma propioceptiva. En consecuencia, nuestro enfoque abre direcciones de investigación sin explotar y poco investigadas relacionadas con la dinámica y el control avanzado de robots continuos, donde es obligatorio detectar el flujo y el esfuerzo generalizados. Además de eso, democratizamos la investigación de robots continuos al proporcionar software y hardware de código abierto con nuestra iniciativa llamada Open Continuum Robotics Project, para aumentar la accesibilidad y reproducibilidad de métodos avanzados."],
        ["ar", "تعتبر التجارب الفعلية على الروبوتات المستمرة هي المعيار الذهبي للدراسات التقييمية. في الوقت الحالي، نظرًا لعدم توفر منصة تجارية للروبوتات المستمرة، توجد مجموعة كبيرة من النماذج الأولية. يتم تطوير هذه النماذج الأولية بواسطة مجموعات بحث فردية وغالبًا ما يتم استخدامها إلا لمنشور واحد. بالتالي، يتم تخصيص قدر كبير من الوقت لإنشاء أجهزة وبرامج خاصة تعيق تطوير نظام أساسي مشترك، وتحوّل الوقت والجهود النادرة عن تحديات البحث الرئيسية.\n\nنحن نعالج هذه المشكلة من خلال اقتراح وحدة تشغيل متاحة المصدر، والتي يمكن استخدامها لبناء أنواع مختلفة من الروبوتات المتصلة. هذه الوحدة تتألف من محرك كهربائي بدون فرش ذو عزم دوران عالي، وجهاز تشفير بصري عالي الدقة، وناقل حركة ذو نسبة تروس منخفضة. في هذه الرسالة، قمنا بإنشاء ثلاثة أنواع مختلفة من الروبوتات المتصلة. بالإضافة إلى ذلك، نوضح، لأول مرة، أن الروبوتات المتصلة المبنية بوحدة التشغيل الخاصة بنا يمكنها اكتشاف القوى الخارجية بشكل عميق. وبالتالي، فإن نهجنا يفتح اتجاهات بحثية غير مستغلة وغير مدروسة تتعلق بالديناميكيات والتحكم المتقدم في الروبوتات المتصلة، حيث يكون استشعار التدفق والجهد المعمم أمرًا إلزاميًا. بالإضافة إلى ذلك، نقوم بإضفاء الطابع الديمقراطي على أبحاث الروبوتات المستمرة من خلال توفير برامج وأجهزة مفتوحة المصدر من خلال مبادرتنا التي تسمى مشروع 'الروبوتات المستمرة المتاحة'، لزيادة إمكانية الوصول إلى أساليب متقدمة وإمكانية تكرار نتائجها."]
    ]
}